app/views/menu/index.html.erb

                <ul>
                    <% MenuCategory.all.each do |menuCat| %>
---
SELECT "menu_categories".* FROM "menu_categories"