app/views/owner/_menu-category.html.erb

 <ul>
  <% MenuItem.all.each do |menu| %>
---
SELECT "menu_items".* FROM "menu_items"