app/views/owner/_menu-Category.html.erb

SELECT "menu_items".* FROM "menu_items"
---
 <ul>
  <% MenuItem.all.each do |menu| %>