app/views/owner/index.html.erb

SELECT "menu_categories".* FROM "menu_categories"
---
                <ul>
                    <% MenuCategory.all.each do |menuCat| %>

SELECT "menu_categories".* FROM "menu_categories"
---
      <section>
        <% MenuCategory.all.each do |menuCat| %>