app/controllers/menu_controller.rb

SELECT "menu_categories"."id" FROM "menu_categories" WHERE "menu_categories"."name" = $1  [["name", "Breakfast"]]
INSERT INTO "menu_items" ("menu_category_id", "name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["menu_category_id", "1.0"], ["name", "asf"], ["description", ""], ["price", "45.0"], ["created_at", "2021-11-25 09:23:11.986162"], ["updated_at", "2021-11-25 09:23:11.986162"]]
---
  def create
    menu_category = params[:category]
    menu_category_id = MenuCategory.where(name: menu_category).ids.first.to_i
    menu_name = params[:name]
    menu_description = params[:description]
    menu_price = params[:price]

    new_menu = MenuItem.new(
      menu_category_id: menu_category_id,
      name: menu_name,
      description: menu_description,
      price: menu_price,
    )
    if new_menu.save