app/controllers/owner_controller.rb

  def create
    menu_category = params[:category]
    menu_category_id = MenuCategory.where(name: menu_category).ids.first.to_i
    menu_name = params[:name]
    menu_description = params[:description]
    menu_price = params[:price]

    new_menu = MenuItem.new(
      menu_category_id: menu_category_id,
      name: menu_name,
      description: menu_description,
      price: menu_price,
    )
    if new_menu.save
---
SELECT "menu_categories"."id" FROM "menu_categories" WHERE "menu_categories"."name" = $1  [["name", "green"]]
INSERT INTO "menu_items" ("menu_category_id", "name", "description", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["menu_category_id", "0.0"], ["name", "coffee"], ["description", ""], ["price", "30.0"], ["created_at", "2021-11-24 05:01:42.701261"], ["updated_at", "2021-11-24 05:01:42.701261"]]

  def destroy
    id = params[:id]
    menu_item = MenuItem.find(id)
    menu_item.destroy
---
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "menu_items" WHERE "menu_items"."id" = $1  [["id", 24]]